import axios from "axios";
import { useEffect, useState } from "react";
import { Link, useNavigate, useParams } from "react-router-dom";
import MyNavbar from "../../components/MyNavbar/MyNavbar";
import { Col, Container, Row } from "react-bootstrap";
import Button from 'react-bootstrap/Button';
import Card from 'react-bootstrap/Card';
import Footer from "../../components/Footer/Footer";
import { FaRegPenToSquare } from "react-icons/fa6";
import { MdAccessTime } from "react-icons/md";
import { FaLayerGroup } from "react-icons/fa";
import { MdDeleteForever } from "react-icons/md";
import Swal from "sweetalert2";


function Article() {
    const idParams = useParams().id
    const [articleData, setArticleData] = useState({})
    const navigate = useNavigate()

    useEffect(() => {
        axios.get(`http://localhost:5000/articles/${idParams}`)
            .then(response => setArticleData(response.data))
        window.scrollTo(0, 0);
    }, [])

    const deleteArticle = (idParams) => {

        Swal.fire({
            title: "از حذف مقاله مطمئن هستید ؟",
            color: "#d33",
            icon: "warning",
            iconColor: "#d33",
            showCancelButton: true,
            confirmButtonColor: "#d33",
            confirmButtonText: "بله",
            cancelButtonText: "خیر"
        }).then((result) => {
            if (result.isConfirmed) {
                Swal.fire({
                    title: "مقاله مورد نظر حذف شد",
                    icon: "success",
                    showConfirmButton: false,
                    timerProgressBar: true,
                    timer: "1500"
                });
                axios.delete(`http://localhost:5000/articles/${idParams}`);
                setTimeout(() => {
                    navigate('/');
                }, 1750);
            }
        });
    }

    return (
        <>
            <MyNavbar />
            <Container>
                <Row>
                    <Col lg={4} >
                        <Card >
                            <Card.Img variant="top" src={articleData.image} />
                            <Card.Body>
                                <Card.Title className="text-center mb-3">{articleData.title}</Card.Title>
                                <Card.Text>
                                    <p>
                                        <FaRegPenToSquare className="me-2" />
                                        نویسنده : {articleData.writer}
                                    </p>
                                    <p>
                                        <MdAccessTime className="me-2" />
                                        مدت زمان مطالعه : {articleData.readingTime} دقیقه
                                    </p>
                                    <p>
                                        <FaLayerGroup className="me-2" />
                                        دسته بندی :   {articleData.category}
                                    </p>
                                </Card.Text>

                                <Link to={`/editArticle/${idParams}`}> <Button className="mx-4" variant="primary">ویرایش مقاله</Button></Link>

                                <Button onClick={() => deleteArticle(idParams)} variant="danger">حذف مقاله <MdDeleteForever /></Button>
                            </Card.Body>
                        </Card>

                    </Col>

                    <Col lg={8}>
                        <h1>{articleData.title}</h1>
                        <p style={{ textAlign: 'justify' }}>تکنولوژی به عنوان نیروی محرکه‌ی اصلی تغییرات در دنیای مدرن، نقش بسیار مهمی در تمامی ابعاد زندگی انسان‌ها ایفا می‌کند. از ابزارهای ساده‌ی روزمره گرفته تا سیستم‌های پیچیده‌ی صنعتی و علمی، تکنولوژی همواره در حال تحول و پیشرفت است و تاثیرات عمیقی بر جوامع بشری و محیط زیست دارد.

                            تاریخچه و سیر تحول تکنولوژی

                            تکنولوژی از زمان‌های باستان با انسان همراه بوده است. از استفاده از سنگ و چوب برای ساخت ابزارهای اولیه تا توسعه‌ی ماشین‌آلات پیچیده در دوران انقلاب صنعتی، هر دوره‌ای از تاریخ بشر شاهد پیشرفت‌های چشمگیری در زمینه‌ی تکنولوژی بوده است. با آغاز قرن بیستم و ظهور فناوری‌های نوینی مانند الکتریسیته، تلفن، و در نهایت کامپیوترها، سرعت پیشرفت تکنولوژی به طرز چشمگیری افزایش یافت.

                            فناوری اطلاعات و ارتباطات

                            یکی از مهم‌ترین شاخه‌های تکنولوژی در دنیای امروز، فناوری اطلاعات و ارتباطات (ICT) است. این حوزه شامل کامپیوترها، اینترنت، و دستگاه‌های همراه می‌شود که تغییرات اساسی در نحوه‌ی ارتباطات، دسترسی به اطلاعات، و انجام امور روزمره ایجاد کرده‌اند. اینترنت به عنوان شبکه‌ای جهانی، امکان ارتباط بین افراد در سراسر جهان را فراهم کرده و به بستری برای تجارت الکترونیک، آموزش آنلاین، و سرگرمی تبدیل شده است.

                            هوش مصنوعی و یادگیری ماشین

                            هوش مصنوعی (AI) یکی دیگر از حوزه‌های برجسته‌ی تکنولوژی است که تاثیرات عمیقی بر صنایع مختلف دارد. با توسعه‌ی الگوریتم‌های پیچیده‌ی یادگیری ماشین، سیستم‌های هوش مصنوعی قادر به انجام وظایفی شده‌اند که قبلا فقط انسان‌ها قادر به انجام آن بودند. از تشخیص تصاویر و صداها تا پردازش زبان طبیعی و پیش‌بینی‌های پیچیده، هوش مصنوعی در حال تغییر شیوه‌ی کار و زندگی ماست.

                            تکنولوژی‌های نانو و بیوتکنولوژی

                            تکنولوژی نانو و بیوتکنولوژی نیز از جمله زمینه‌های مهمی هستند که پیشرفت‌های آن‌ها نویدبخش آینده‌ای متفاوت برای بشر است. نانوتکنولوژی با استفاده از مواد در مقیاس نانومتر، امکان ساخت مواد و دستگاه‌های جدید با ویژگی‌های منحصر به فرد را فراهم کرده است. از طرفی، بیوتکنولوژی با استفاده از فرآیندهای بیولوژیکی، تحولی در حوزه‌ی پزشکی، کشاورزی، و محیط زیست ایجاد کرده است.

                            انقلاب صنعتی چهارم

                            یکی از مفاهیم جدید در حوزه‌ی تکنولوژی، انقلاب صنعتی چهارم است. این انقلاب که بر پایه‌ی تکنولوژی‌های دیجیتال و هوش مصنوعی بنا شده، به معنای تلفیق فیزیکی و دیجیتال در صنایع مختلف است. اینترنت اشیا (IoT)، رباتیک پیشرفته، و چاپ سه‌بعدی از جمله تکنولوژی‌های کلیدی این انقلاب هستند. این تکنولوژی‌ها باعث افزایش کارایی و دقت در تولید و خدمات شده و زمینه‌ساز ایجاد محصولات و خدمات نوین می‌شوند.

                            تکنولوژی در حوزه‌ی سلامت

                            تکنولوژی نقش بسیار مهمی در بهبود سلامت انسان‌ها ایفا کرده است. از دستگاه‌های پیشرفته‌ی تشخیصی تا روش‌های نوین درمانی، تکنولوژی به پزشکان و محققان امکان داده تا بیماری‌ها را بهتر شناسایی و درمان کنند. تکنولوژی‌های مانند جراحی رباتیک، پرینترهای زیستی برای ساخت بافت‌های انسانی، و سیستم‌های پایش سلامت از راه دور نمونه‌هایی از این تحولات هستند.

                            تکنولوژی‌های پایدار و محیط زیست

                            یکی از چالش‌های بزرگ دنیای مدرن، حفظ محیط زیست و کاهش اثرات مخرب انسانی بر آن است. تکنولوژی‌های پایدار می‌توانند در این زمینه نقش حیاتی ایفا کنند. از تولید انرژی‌های تجدیدپذیر مانند خورشیدی و بادی تا تکنولوژی‌های مدیریت پسماند و تصفیه آب، پیشرفت‌های تکنولوژیک می‌توانند به حفظ و بهبود وضعیت محیط زیست کمک کنند. استفاده از مواد دوستدار محیط زیست و کاهش مصرف منابع طبیعی نیز از دیگر اهداف تکنولوژی‌های پایدار است.

                            تکنولوژی و آموزش

                            تکنولوژی نقش بسیار مهمی در تحول نظام‌های آموزشی ایفا کرده است. ابزارهای دیجیتال و اینترنت به معلمان و دانش‌آموزان امکان دسترسی به منابع آموزشی گسترده و متنوع را داده‌اند. آموزش آنلاین، واقعیت افزوده (AR) و واقعیت مجازی (VR) در کلاس‌های درس، و استفاده از هوش مصنوعی برای شخصی‌سازی فرآیند یادگیری از جمله تغییرات اساسی هستند که تکنولوژی در حوزه‌ی آموزش ایجاد کرده است.

                            چالش‌ها و مسائل اخلاقی

                            با وجود تمامی مزایایی که تکنولوژی به همراه دارد، چالش‌ها و مسائل اخلاقی نیز همواره همراه آن بوده است. از نگرانی‌های مربوط به حفظ حریم خصوصی و امنیت اطلاعات گرفته تا تاثیرات زیست‌محیطی و اجتماعی فناوری‌های جدید، همواره نیاز به بررسی و مدیریت دقیق وجود دارد. همچنین، مسائلی مانند نابرابری دسترسی به فناوری و تاثیرات آن بر بازار کار و اشتغال نیز از جمله موضوعاتی هستند که باید مورد توجه قرار گیرند.

                            آینده‌ی تکنولوژی

                            آینده‌ی تکنولوژی بدون شک پر از نوآوری‌ها و پیشرفت‌های جدید خواهد بود. حوزه‌هایی مانند هوش مصنوعی، اینترنت اشیا (IoT)، رباتیک، و واقعیت مجازی و افزوده (VR/AR) همچنان به سرعت در حال توسعه هستند و انتظار می‌رود تاثیرات شگرفی بر زندگی انسان‌ها داشته باشند. در عین حال، توجه به مسائل اخلاقی و اجتماعی مرتبط با این پیشرفت‌ها و یافتن راه‌حل‌هایی برای مدیریت چالش‌های پیش‌رو ضروری خواهد بود.

                            <h3>نتیجه‌گیری</h3>

                            تکنولوژی به عنوان یک عامل اساسی در تحول و پیشرفت بشریت، همچنان به رشد و توسعه ادامه خواهد داد. با در نظر گرفتن تاثیرات مثبت و منفی آن بر جوامع و محیط زیست، می‌توان از ظرفیت‌های عظیم تکنولوژی برای ساختن آینده‌ای بهتر بهره برد. بررسی مستمر و دقیق پیشرفت‌های تکنولوژیکی و توجه به جنبه‌های اخلاقی و اجتماعی آن‌ها، کلید موفقیت در این مسیر خواهد بود.

                        </p>
                    </Col>
                </Row>
            </Container>
            <Footer />
        </>

    )
}
export default Article;